<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,224,224,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/Transpose([0 3 1 2])/value21343287" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1/Transpose([0 3 1 2])/value21343287"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="input_1/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model/block1_conv1/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 3, 3, 3" offset="32" size="3456"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model/block1_conv1/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv1/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_conv1/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model/block1_conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block1_conv1/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model/block1_conv1/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="3488" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model/block1_conv1/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv1/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_conv1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model/block1_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block1_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model/block1_conv1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_conv1/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model/block1_conv2/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="3616" size="73728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model/block1_conv2/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv2/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_conv2/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model/block1_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block1_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model/block1_conv2/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="77344" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model/block1_conv2/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv2/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_conv2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model/block1_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv2/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block1_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model/block1_conv2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_conv2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_conv2/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model/block1_pool/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block1_pool/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block1_pool/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model/block2_conv1/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="77472" size="147456"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model/block2_conv1/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv1/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_conv1/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model/block2_conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block2_conv1/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model/block2_conv1/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="224928" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model/block2_conv1/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv1/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_conv1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model/block2_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block2_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model/block2_conv1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_conv1/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model/block2_conv2/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="225184" size="294912"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model/block2_conv2/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv2/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_conv2/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model/block2_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block2_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model/block2_conv2/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="520096" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model/block2_conv2/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv2/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_conv2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model/block2_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv2/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block2_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model/block2_conv2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_conv2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_conv2/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model/block2_pool/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block2_pool/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block2_pool/MaxPool:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model/block3_conv1/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 3, 3" offset="520352" size="589824"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model/block3_conv1/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv1/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv1/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model/block3_conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv1/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model/block3_conv1/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="1110176" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model/block3_conv1/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv1/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model/block3_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model/block3_conv1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv1/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model/block3_conv2/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="1110688" size="1179648"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model/block3_conv2/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv2/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv2/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model/block3_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model/block3_conv2/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="2290336" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model/block3_conv2/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv2/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model/block3_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv2/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model/block3_conv2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv2/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model/block3_conv3/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="2290848" size="1179648"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model/block3_conv3/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv3/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv3/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model/block3_conv3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv3/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model/block3_conv3/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="3470496" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model/block3_conv3/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv3/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv3/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model/block3_conv3/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv3/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv3/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model/block3_conv3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv3/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv3/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model/block3_conv4/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="3471008" size="1179648"/>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model/block3_conv4/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv4/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv4/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model/block3_conv4/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv4/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv4/Conv2D:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model/block3_conv4/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="4650656" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model/block3_conv4/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv4/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv4/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model/block3_conv4/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv4/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block3_conv4/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model/block3_conv4/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_conv4/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_conv4/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model/block3_pool/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block3_pool/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block3_pool/MaxPool:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model/block4_conv1/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 256, 3, 3" offset="4651168" size="2359296"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model/block4_conv1/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv1/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv1/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model/block4_conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block4_conv1/Conv2D:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model/block4_conv1/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="7010464" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model/block4_conv1/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv1/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model/block4_conv1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block4_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model/block4_conv1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv1/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model/block4_conv2/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="7011488" size="4718592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model/block4_conv2/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv2/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv2/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model/block4_conv2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block4_conv2/Conv2D:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model/block4_conv2/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="11730080" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model/block4_conv2/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv2/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model/block4_conv2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv2/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model/block4_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model/block4_conv2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv2/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/model/block4_conv3/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="11731104" size="4718592"/>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/model/block4_conv3/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv3/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model/block4_conv3/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model/block4_conv3/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model/block4_conv3/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
